/*
Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
m = 2, n = 3 -> A(m,n) = 9
m = 3, n = 2 -> A(m,n) = 29
*/


Console.Clear();

int UserEnter(string message)
{
    System.Console.Write(message);
    int result = Convert.ToInt32(Console.ReadLine());
    return result;
}

int Akerman(int n, int m)
{
  if (n == 0)
    return m + 1;
  else
    if ((n != 0) && (m == 0))
      return Akerman(n - 1, 1);
    else
      return Akerman(n - 1, Akerman(n, m - 1));
}
int userNum1 = UserEnter("Введите число M: ");
int userNum2 = UserEnter("Введите число N: ");
int userSum = Akerman(userNum1, userNum2);
System.Console.WriteLine($"M = {userNum1}, N = {userNum2} -> A(m,n) = {userSum}");